{"class_name": "Model", "keras_version": "2.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 20], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "stem_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "stem_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "stem_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["stem_conv1", 0, 0, {}]]], "name": "stem_bn1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "reduction_conv_1_stem_1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "reduction_conv_1_stem_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "reduction_bn_1_stem_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["reduction_conv_1_stem_1", 0, 0, {}]]], "name": "reduction_bn_1_stem_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["reduction_bn_1_stem_1", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_4"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [2, 2], "pointwise_regularizer": null, "filters": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [5, 5], "name": "separable_conv_1_reduction_left1_stem_1"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "separable_conv_1_reduction_left1_stem_1"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [2, 2], "pointwise_regularizer": null, "filters": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [7, 7], "name": "separable_conv_1_reduction_right1_stem_1"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "separable_conv_1_reduction_right1_stem_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_1_bn_reduction_left1_stem_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_1_reduction_left1_stem_1", 0, 0, {}]]], "name": "separable_conv_1_bn_reduction_left1_stem_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_1_bn_reduction_right1_stem_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_1_reduction_right1_stem_1", 0, 0, {}]]], "name": "separable_conv_1_bn_reduction_right1_stem_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_left1_stem_1", 0, 0, {}]]], "name": "activation_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right1_stem_1", 0, 0, {}]]], "name": "activation_5"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "filters": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [5, 5], "name": "separable_conv_2_reduction_left1_stem_1"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "separable_conv_2_reduction_left1_stem_1"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "filters": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [7, 7], "name": "separable_conv_2_reduction_right1_stem_1"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "separable_conv_2_reduction_right1_stem_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_2_bn_reduction_left1_stem_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_2_reduction_left1_stem_1", 0, 0, {}]]], "name": "separable_conv_2_bn_reduction_left1_stem_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_2_bn_reduction_right1_stem_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_2_reduction_right1_stem_1", 0, 0, {}]]], "name": "separable_conv_2_bn_reduction_right1_stem_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_6"}, {"class_name": "Add", "config": {"trainable": true, "name": "reduction_add_1_stem_1"}, "inbound_nodes": [[["separable_conv_2_bn_reduction_left1_stem_1", 0, 0, {}], ["separable_conv_2_bn_reduction_right1_stem_1", 0, 0, {}]]], "name": "reduction_add_1_stem_1"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [2, 2], "pointwise_regularizer": null, "filters": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [7, 7], "name": "separable_conv_1_reduction_right2_stem_1"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "separable_conv_1_reduction_right2_stem_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "activation_8"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "inbound_nodes": [[["reduction_add_1_stem_1", 0, 0, {}]]], "name": "activation_10"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_1_bn_reduction_right2_stem_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_1_reduction_right2_stem_1", 0, 0, {}]]], "name": "separable_conv_1_bn_reduction_right2_stem_1"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [2, 2], "pointwise_regularizer": null, "filters": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [5, 5], "name": "separable_conv_1_reduction_right3_stem_1"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "separable_conv_1_reduction_right3_stem_1"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "filters": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "name": "separable_conv_1_reduction_left4_stem_1"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "separable_conv_1_reduction_left4_stem_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right2_stem_1", 0, 0, {}]]], "name": "activation_7"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_1_bn_reduction_right3_stem_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_1_reduction_right3_stem_1", 0, 0, {}]]], "name": "separable_conv_1_bn_reduction_right3_stem_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_1_bn_reduction_left4_stem_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_1_reduction_left4_stem_1", 0, 0, {}]]], "name": "separable_conv_1_bn_reduction_left4_stem_1"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "filters": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [7, 7], "name": "separable_conv_2_reduction_right2_stem_1"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "separable_conv_2_reduction_right2_stem_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right3_stem_1", 0, 0, {}]]], "name": "activation_9"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_left4_stem_1", 0, 0, {}]]], "name": "activation_11"}, {"class_name": "MaxPooling2D", "config": {"name": "reduction_left2_stem_1", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["reduction_bn_1_stem_1", 0, 0, {}]]], "name": "reduction_left2_stem_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_2_bn_reduction_right2_stem_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_2_reduction_right2_stem_1", 0, 0, {}]]], "name": "separable_conv_2_bn_reduction_right2_stem_1"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "filters": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [5, 5], "name": "separable_conv_2_reduction_right3_stem_1"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "separable_conv_2_reduction_right3_stem_1"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "filters": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "name": "separable_conv_2_reduction_left4_stem_1"}, "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "separable_conv_2_reduction_left4_stem_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "adjust_relu_1_stem_2"}, "inbound_nodes": [[["stem_bn1", 0, 0, {}]]], "name": "adjust_relu_1_stem_2"}, {"class_name": "Add", "config": {"trainable": true, "name": "reduction_add_2_stem_1"}, "inbound_nodes": [[["reduction_left2_stem_1", 0, 0, {}], ["separable_conv_2_bn_reduction_right2_stem_1", 0, 0, {}]]], "name": "reduction_add_2_stem_1"}, {"class_name": "AveragePooling2D", "config": {"name": "reduction_left3_stem_1", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["reduction_bn_1_stem_1", 0, 0, {}]]], "name": "reduction_left3_stem_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_2_bn_reduction_right3_stem_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_2_reduction_right3_stem_1", 0, 0, {}]]], "name": "separable_conv_2_bn_reduction_right3_stem_1"}, {"class_name": "AveragePooling2D", "config": {"name": "reduction_left4_stem_1", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["reduction_add_1_stem_1", 0, 0, {}]]], "name": "reduction_left4_stem_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_2_bn_reduction_left4_stem_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_2_reduction_left4_stem_1", 0, 0, {}]]], "name": "separable_conv_2_bn_reduction_left4_stem_1"}, {"class_name": "MaxPooling2D", "config": {"name": "reduction_right5_stem_1", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["reduction_bn_1_stem_1", 0, 0, {}]]], "name": "reduction_right5_stem_1"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "trainable": true, "name": "zero_padding2d_1", "data_format": "channels_last"}, "inbound_nodes": [[["adjust_relu_1_stem_2", 0, 0, {}]]], "name": "zero_padding2d_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "reduction_add3_stem_1"}, "inbound_nodes": [[["reduction_left3_stem_1", 0, 0, {}], ["separable_conv_2_bn_reduction_right3_stem_1", 0, 0, {}]]], "name": "reduction_add3_stem_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["reduction_add_2_stem_1", 0, 0, {}], ["reduction_left4_stem_1", 0, 0, {}]]], "name": "add_1"}, {"class_name": "Add", "config": {"trainable": true, "name": "reduction_add4_stem_1"}, "inbound_nodes": [[["separable_conv_2_bn_reduction_left4_stem_1", 0, 0, {}], ["reduction_right5_stem_1", 0, 0, {}]]], "name": "reduction_add4_stem_1"}, {"class_name": "Cropping2D", "config": {"cropping": [[1, 0], [1, 0]], "trainable": true, "name": "cropping2d_1", "data_format": "channels_last"}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "name": "cropping2d_1"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "reduction_concat_stem_1", "axis": -1}, "inbound_nodes": [[["reduction_add_2_stem_1", 0, 0, {}], ["reduction_add3_stem_1", 0, 0, {}], ["add_1", 0, 0, {}], ["reduction_add4_stem_1", 0, 0, {}]]], "name": "reduction_concat_stem_1"}, {"class_name": "AveragePooling2D", "config": {"name": "adjust_avg_pool_1_stem_2", "trainable": true, "data_format": "channels_last", "pool_size": [1, 1], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["adjust_relu_1_stem_2", 0, 0, {}]]], "name": "adjust_avg_pool_1_stem_2"}, {"class_name": "AveragePooling2D", "config": {"name": "adjust_avg_pool_2_stem_2", "trainable": true, "data_format": "channels_last", "pool_size": [1, 1], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["cropping2d_1", 0, 0, {}]]], "name": "adjust_avg_pool_2_stem_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "inbound_nodes": [[["reduction_concat_stem_1", 0, 0, {}]]], "name": "activation_12"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "adjust_conv_1_stem_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["adjust_avg_pool_1_stem_2", 0, 0, {}]]], "name": "adjust_conv_1_stem_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "adjust_conv_2_stem_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 11, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["adjust_avg_pool_2_stem_2", 0, 0, {}]]], "name": "adjust_conv_2_stem_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "reduction_conv_1_stem_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 22, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "reduction_conv_1_stem_2"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "inbound_nodes": [[["adjust_conv_1_stem_2", 0, 0, {}], ["adjust_conv_2_stem_2", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "reduction_bn_1_stem_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["reduction_conv_1_stem_2", 0, 0, {}]]], "name": "reduction_bn_1_stem_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "adjust_bn_stem_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "adjust_bn_stem_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}, "inbound_nodes": [[["reduction_bn_1_stem_2", 0, 0, {}]]], "name": "activation_13"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}, "inbound_nodes": [[["adjust_bn_stem_2", 0, 0, {}]]], "name": "activation_15"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [2, 2], "pointwise_regularizer": null, "filters": 22, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [5, 5], "name": "separable_conv_1_reduction_left1_stem_2"}, "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "separable_conv_1_reduction_left1_stem_2"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [2, 2], "pointwise_regularizer": null, "filters": 22, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [7, 7], "name": "separable_conv_1_reduction_right1_stem_2"}, "inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "separable_conv_1_reduction_right1_stem_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_1_bn_reduction_left1_stem_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_1_reduction_left1_stem_2", 0, 0, {}]]], "name": "separable_conv_1_bn_reduction_left1_stem_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_1_bn_reduction_right1_stem_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_1_reduction_right1_stem_2", 0, 0, {}]]], "name": "separable_conv_1_bn_reduction_right1_stem_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_left1_stem_2", 0, 0, {}]]], "name": "activation_14"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right1_stem_2", 0, 0, {}]]], "name": "activation_16"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "filters": 22, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [5, 5], "name": "separable_conv_2_reduction_left1_stem_2"}, "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "separable_conv_2_reduction_left1_stem_2"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "filters": 22, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [7, 7], "name": "separable_conv_2_reduction_right1_stem_2"}, "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "separable_conv_2_reduction_right1_stem_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_2_bn_reduction_left1_stem_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_2_reduction_left1_stem_2", 0, 0, {}]]], "name": "separable_conv_2_bn_reduction_left1_stem_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_2_bn_reduction_right1_stem_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_2_reduction_right1_stem_2", 0, 0, {}]]], "name": "separable_conv_2_bn_reduction_right1_stem_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}, "inbound_nodes": [[["adjust_bn_stem_2", 0, 0, {}]]], "name": "activation_17"}, {"class_name": "Add", "config": {"trainable": true, "name": "reduction_add_1_stem_2"}, "inbound_nodes": [[["separable_conv_2_bn_reduction_left1_stem_2", 0, 0, {}], ["separable_conv_2_bn_reduction_right1_stem_2", 0, 0, {}]]], "name": "reduction_add_1_stem_2"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [2, 2], "pointwise_regularizer": null, "filters": 22, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [7, 7], "name": "separable_conv_1_reduction_right2_stem_2"}, "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "separable_conv_1_reduction_right2_stem_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_19"}, "inbound_nodes": [[["adjust_bn_stem_2", 0, 0, {}]]], "name": "activation_19"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}, "inbound_nodes": [[["reduction_add_1_stem_2", 0, 0, {}]]], "name": "activation_21"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_1_bn_reduction_right2_stem_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_1_reduction_right2_stem_2", 0, 0, {}]]], "name": "separable_conv_1_bn_reduction_right2_stem_2"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [2, 2], "pointwise_regularizer": null, "filters": 22, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [5, 5], "name": "separable_conv_1_reduction_right3_stem_2"}, "inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "separable_conv_1_reduction_right3_stem_2"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "filters": 22, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "name": "separable_conv_1_reduction_left4_stem_2"}, "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "separable_conv_1_reduction_left4_stem_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_18"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right2_stem_2", 0, 0, {}]]], "name": "activation_18"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_1_bn_reduction_right3_stem_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_1_reduction_right3_stem_2", 0, 0, {}]]], "name": "separable_conv_1_bn_reduction_right3_stem_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_1_bn_reduction_left4_stem_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_1_reduction_left4_stem_2", 0, 0, {}]]], "name": "separable_conv_1_bn_reduction_left4_stem_2"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "filters": 22, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [7, 7], "name": "separable_conv_2_reduction_right2_stem_2"}, "inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "separable_conv_2_reduction_right2_stem_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_20"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_right3_stem_2", 0, 0, {}]]], "name": "activation_20"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_22"}, "inbound_nodes": [[["separable_conv_1_bn_reduction_left4_stem_2", 0, 0, {}]]], "name": "activation_22"}, {"class_name": "MaxPooling2D", "config": {"name": "reduction_left2_stem_2", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["reduction_bn_1_stem_2", 0, 0, {}]]], "name": "reduction_left2_stem_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_2_bn_reduction_right2_stem_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_2_reduction_right2_stem_2", 0, 0, {}]]], "name": "separable_conv_2_bn_reduction_right2_stem_2"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "filters": 22, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [5, 5], "name": "separable_conv_2_reduction_right3_stem_2"}, "inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "separable_conv_2_reduction_right3_stem_2"}, {"class_name": "SeparableConv2D", "config": {"padding": "same", "use_bias": false, "bias_regularizer": null, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "pointwise_constraint": null, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "depthwise_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "filters": 22, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "dilation_rate": [1, 1], "depthwise_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "name": "separable_conv_2_reduction_left4_stem_2"}, "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "separable_conv_2_reduction_left4_stem_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "adjust_relu_1_0"}, "inbound_nodes": [[["reduction_concat_stem_1", 0, 0, {}]]], "name": "adjust_relu_1_0"}, {"class_name": "Add", "config": {"trainable": true, "name": "reduction_add_2_stem_2"}, "inbound_nodes": [[["reduction_left2_stem_2", 0, 0, {}], ["separable_conv_2_bn_reduction_right2_stem_2", 0, 0, {}]]], "name": "reduction_add_2_stem_2"}, {"class_name": "AveragePooling2D", "config": {"name": "reduction_left3_stem_2", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["reduction_bn_1_stem_2", 0, 0, {}]]], "name": "reduction_left3_stem_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_2_bn_reduction_right3_stem_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_2_reduction_right3_stem_2", 0, 0, {}]]], "name": "separable_conv_2_bn_reduction_right3_stem_2"}, {"class_name": "AveragePooling2D", "config": {"name": "reduction_left4_stem_2", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "inbound_nodes": [[["reduction_add_1_stem_2", 0, 0, {}]]], "name": "reduction_left4_stem_2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "separable_conv_2_bn_reduction_left4_stem_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9997, "center": true}, "inbound_nodes": [[["separable_conv_2_reduction_left4_stem_2", 0, 0, {}]]], "name": "separable_conv_2_bn_reduction_left4_stem_2"}, {"class_name": "MaxPooling2D", "config": {"name": "reduction_right5_stem_2", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [2, 2]}, "inbound_nodes": [[["reduction_bn_1_stem_2", 0, 0, {}]]], "name": "reduction_right5_stem_2"}, {"class_name": "ZeroPadding2D", "config": {"padding": [[0, 1], [0, 1]], "trainable": true, "name": "zero_padding2d_2", "data_format": "channels_last"}, "inbound_nodes": [[["adjust_relu_1_0", 0, 0, {}]]], "name": "zero_padding2d_2"}, {"class_name": "Add", "config": {"trainable": true, "name": "reduction_add3_stem_2"}, "inbound_nodes": [[["reduction_left3_stem_2", 